"""
Модуль для определения действий с акциями на фондовом рынке.

В этом модуле определена модель StockAction, которая используется для
представления действий с акциями, таких как покупка или продажа.
Модель включает следующие поля:

- ticker (str): Тикер акции, представляющий уникальный идентификатор
  для конкретной акции на фондовом рынке.
- action (Literal["BUY", "SELL"]): Действие, которое будет выполнено
  с акцией, может быть либо "BUY" (покупка), либо "SELL" (продажа).
"""
from typing import Literal

from pydantic import BaseModel


class StockAction(BaseModel):
    ticker: str
    action: Literal["BUY", "SELL"]


